sebanc/brunch/external-drivers/rtl8723du/core/rtw_ap.c
	sta_update_last_rx_pkts(psta);

	return ret;
}

void	expire_timeout_chk(struct adapter *adapt)
{
	unsigned long irqL;
	struct list_head	*phead, *plist;
	u8 updated = false;
	struct sta_info *psta = NULL;
	struct sta_priv *pstapriv = &adapt->stapriv;
	u8 chk_alive_num = 0;
	char chk_alive_list[NUM_STA];
	int i;


	_enter_critical_bh(&pstapriv->auth_list_lock, &irqL);

	phead = &pstapriv->auth_list;
	plist = get_next(phead);

	/* check auth_queue */
	while ((!rtw_end_of_queue_search(phead, plist))) {
		psta = container_of(plist, struct sta_info, auth_list);

		plist = get_next(plist);

		if (psta->expire_to > 0) {
			psta->expire_to--;
			if (psta->expire_to == 0) {
				rtw_list_delete(&psta->auth_list);
				pstapriv->auth_list_cnt--;

				RTW_INFO("auth expire %02X%02X%02X%02X%02X%02X\n",
					psta->cmn.mac_addr[0], psta->cmn.mac_addr[1], psta->cmn.mac_addr[2],
					psta->cmn.mac_addr[3], psta->cmn.mac_addr[4], psta->cmn.mac_addr[5]);

				_exit_critical_bh(&pstapriv->auth_list_lock, &irqL);

				rtw_free_stainfo(adapt, psta);

				_enter_critical_bh(&pstapriv->auth_list_lock, &irqL);
			}
		}

	}

	_exit_critical_bh(&pstapriv->auth_list_lock, &irqL);
	psta = NULL;


	_enter_critical_bh(&pstapriv->asoc_list_lock, &irqL);

	phead = &pstapriv->asoc_list;
	plist = get_next(phead);

	/* check asoc_queue */
	while ((!rtw_end_of_queue_search(phead, plist))) {
		psta = container_of(plist, struct sta_info, asoc_list);
		plist = get_next(plist);
		if (chk_sta_is_alive(psta) || !psta->expire_to) {
			psta->expire_to = pstapriv->expire_to;
			psta->keep_alive_trycnt = 0;
			psta->under_exist_checking = 0;
		} else
			psta->expire_to--;

		if (psta->expire_to <= 0) {
			struct mlme_ext_priv *pmlmeext = &adapt->mlmeextpriv;

			if (adapt->registrypriv.wifi_spec == 1) {
				psta->expire_to = pstapriv->expire_to;
				continue;
			}

			if (psta->state & WIFI_SLEEP_STATE) {
				if (!(psta->state & WIFI_STA_ALIVE_CHK_STATE)) {
					/* to check if alive by another methods if staion is at ps mode.					 */
					psta->expire_to = pstapriv->expire_to;
					psta->state |= WIFI_STA_ALIVE_CHK_STATE;

					/* RTW_INFO("alive chk, sta:" MAC_FMT " is at ps mode!\n", MAC_ARG(psta->cmn.mac_addr)); */

					/* to update bcn with tim_bitmap for this station */
					rtw_tim_map_set(adapt, pstapriv->tim_bitmap, psta->cmn.aid);
					update_beacon(adapt, _TIM_IE_, NULL, true);

					if (!pmlmeext->active_keep_alive_check)
						continue;
				}
			}

			{
				int stainfo_offset;

				stainfo_offset = rtw_stainfo_offset(pstapriv, psta);
				if (stainfo_offset_valid(stainfo_offset))
					chk_alive_list[chk_alive_num++] = stainfo_offset;
				continue;
			}
		} else {
			/* TODO: Aging mechanism to digest frames in sleep_q to avoid running out of xmitframe */
			if (psta->sleepq_len > (NR_XMITFRAME / pstapriv->asoc_list_cnt)
			    && adapt->xmitpriv.free_xmitframe_cnt < ((NR_XMITFRAME / pstapriv->asoc_list_cnt) / 2)
			   ) {
				RTW_INFO("%s sta:"MAC_FMT", sleepq_len:%u, free_xmitframe_cnt:%u, asoc_list_cnt:%u, clear sleep_q\n", __func__
					 , MAC_ARG(psta->cmn.mac_addr)
					, psta->sleepq_len, adapt->xmitpriv.free_xmitframe_cnt, pstapriv->asoc_list_cnt);
				wakeup_sta_to_xmit(adapt, psta);
			}
		}
	}

	_exit_critical_bh(&pstapriv->asoc_list_lock, &irqL);

	if (chk_alive_num) {
		u8 backup_ch = 0, backup_bw = 0, backup_offset = 0;
		u8 union_ch = 0, union_bw = 0, union_offset = 0;
		u8 switch_channel_by_drv = true;
		struct mlme_ext_priv *pmlmeext = &adapt->mlmeextpriv;
		char del_asoc_list[NUM_STA];

		memset(del_asoc_list, NUM_STA, NUM_STA);

		if (pmlmeext->active_keep_alive_check) {
			if (!rtw_mi_get_ch_setting_union(adapt, &union_ch, &union_bw, &union_offset)
				|| pmlmeext->cur_channel != union_ch)
				switch_channel_by_drv = false;

			/* switch to correct channel of current network  before issue keep-alive frames */
			if (switch_channel_by_drv && rtw_get_oper_ch(adapt) != pmlmeext->cur_channel) {
				backup_ch = rtw_get_oper_ch(adapt);
				backup_bw = rtw_get_oper_bw(adapt);
				backup_offset = rtw_get_oper_choffset(adapt);
				set_channel_bwmode(adapt, union_ch, union_offset, union_bw);
			}
		}

		/* check loop */
		for (i = 0; i < chk_alive_num; i++) {
			int ret = _FAIL;

			psta = rtw_get_stainfo_by_offset(pstapriv, chk_alive_list[i]);

			if (!(psta->state & _FW_LINKED))
				continue;

			if (pmlmeext->active_keep_alive_check) {
				/* issue null data to check sta alive*/
				if (psta->state & WIFI_SLEEP_STATE)
					ret = issue_nulldata(adapt, psta->cmn.mac_addr, 0, 1, 50);
				else
					ret = issue_nulldata(adapt, psta->cmn.mac_addr, 0, 3, 50);

				psta->keep_alive_trycnt++;
				if (ret == _SUCCESS) {
					RTW_INFO("asoc check, sta(" MAC_FMT ") is alive\n", MAC_ARG(psta->cmn.mac_addr));
					psta->expire_to = pstapriv->expire_to;
					psta->keep_alive_trycnt = 0;
					continue;
				} else if (psta->keep_alive_trycnt <= 3) {
					RTW_INFO("ack check for asoc expire, keep_alive_trycnt=%d\n", psta->keep_alive_trycnt);
					psta->expire_to = 1;
					continue;
				}
			}

			psta->keep_alive_trycnt = 0;
			del_asoc_list[i] = chk_alive_list[i];
			_enter_critical_bh(&pstapriv->asoc_list_lock, &irqL);
			if (!rtw_is_list_empty(&psta->asoc_list)) {
				rtw_list_delete(&psta->asoc_list);
				pstapriv->asoc_list_cnt--;
			}
			_exit_critical_bh(&pstapriv->asoc_list_lock, &irqL);
		}

		/* delete loop */
		for (i = 0; i < chk_alive_num; i++) {
			u8 sta_addr[ETH_ALEN];

			if (del_asoc_list[i] >= NUM_STA)
				continue;

			psta = rtw_get_stainfo_by_offset(pstapriv, del_asoc_list[i]);
			memcpy(sta_addr, psta->cmn.mac_addr, ETH_ALEN);

			RTW_INFO("asoc expire "MAC_FMT", state=0x%x\n", MAC_ARG(psta->cmn.mac_addr), psta->state);
			updated = ap_free_sta(adapt, psta, false, WLAN_REASON_DEAUTH_LEAVING, false);
		}

		if (pmlmeext->active_keep_alive_check) {
			/* back to the original operation channel */
			if (switch_channel_by_drv && backup_ch > 0)
				set_channel_bwmode(adapt, backup_ch, backup_offset, backup_bw);
		}
	}

