sebanc/brunch/external-drivers/rtl8723du/core/rtw_ap.c
		plist = get_next(plist);

	}

	_exit_critical_bh(&(pmlmepriv->scanned_queue.lock), &irqL);

	pmlmepriv->num_sta_no_ht = 0; /* reset to 0 after ap do scanning*/

}

void rtw_start_bss_hdl_after_chbw_decided(struct adapter *adapter)
{
	struct wlan_bssid_ex *pnetwork = &(adapter->mlmepriv.cur_network.network);
	struct sta_info *sta = NULL;

	/* update cur_wireless_mode */
	update_wireless_mode(adapter);

	/* update RRSR and RTS_INIT_RATE register after set channel and bandwidth */
	UpdateBrateTbl(adapter, pnetwork->SupportedRates);
	rtw_hal_set_hwreg(adapter, HW_VAR_BASIC_RATE, pnetwork->SupportedRates);

	/* update capability after cur_wireless_mode updated */
	update_capinfo(adapter, rtw_get_capability(pnetwork));

	/* update bc/mc sta_info */
	update_bmc_sta(adapter);

	/* update AP's sta info */
	sta = rtw_get_stainfo(&adapter->stapriv, pnetwork->MacAddress);
	if (!sta) {
		RTW_INFO(FUNC_ADPT_FMT" !sta for macaddr="MAC_FMT"\n", FUNC_ADPT_ARG(adapter), MAC_ARG(pnetwork->MacAddress));
		rtw_warn_on(1);
		return;
	}

	update_ap_info(adapter, sta);
}

void start_bss_network(struct adapter *adapt, struct createbss_parm *parm)
{
#define DUMP_ADAPTERS_STATUS 0
	u8 self_action = MLME_ACTION_UNKNOWN;
	u8 val8;
	u16 bcn_interval;
	u32	acparm;
	struct registry_priv	*pregpriv = &adapt->registrypriv;
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);
	struct security_priv *psecuritypriv = &(adapt->securitypriv);
	struct wlan_bssid_ex *pnetwork = (struct wlan_bssid_ex *)&pmlmepriv->cur_network.network; /* used as input */
	struct mlme_ext_priv	*pmlmeext = &(adapt->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	struct wlan_bssid_ex *pnetwork_mlmeext = &(pmlmeinfo->network);
	s16 req_ch = -1, req_bw = -1, req_offset = -1;
	bool ch_setting_changed = false;
	u8 ch_to_set = 0, bw_to_set, offset_to_set;
	u8 doiqk = false;
	/* use for check ch bw offset can be allowed or not */
	u8 chbw_allow = true;

	if (MLME_IS_AP(adapt))
		self_action = MLME_AP_STARTED;
	else if (MLME_IS_MESH(adapt))
		self_action = MLME_MESH_STARTED;
	else
		rtw_warn_on(1);

	if (parm->req_ch != 0) {
		/* bypass other setting, go checking ch, bw, offset */
		req_ch = parm->req_ch;
		req_bw = parm->req_bw;
		req_offset = parm->req_offset;
		goto chbw_decision;
	} else {
		/* inform this request comes from upper layer */
		req_ch = 0;
		memcpy(pnetwork_mlmeext, pnetwork, pnetwork->Length);
	}

	bcn_interval = (u16)pnetwork->Configuration.BeaconPeriod;

	/* check if there is wps ie, */
	/* if there is wpsie in beacon, the hostapd will update beacon twice when stating hostapd, */
	/* and at first time the security ie ( RSN/WPA IE) will not include in beacon. */
	if (!rtw_get_wps_ie(pnetwork->IEs + _FIXED_IE_LENGTH_, pnetwork->IELength - _FIXED_IE_LENGTH_, NULL, NULL))
		pmlmeext->bstart_bss = true;

	/* todo: update wmm, ht cap */
	/* pmlmeinfo->WMM_enable; */
	/* pmlmeinfo->HT_enable; */
	if (pmlmepriv->qospriv.qos_option)
		pmlmeinfo->WMM_enable = true;
	if (pmlmepriv->htpriv.ht_option) {
		pmlmeinfo->WMM_enable = true;
		pmlmeinfo->HT_enable = true;
		/* pmlmeinfo->HT_info_enable = true; */
		/* pmlmeinfo->HT_caps_enable = true; */

		update_hw_ht_param(adapt);
	}

	if (!pmlmepriv->cur_network.join_res) { /* setting only at  first time */
		/* WEP Key will be set before this function, do not clear CAM. */
		if ((psecuritypriv->dot11PrivacyAlgrthm != _WEP40_) && (psecuritypriv->dot11PrivacyAlgrthm != _WEP104_))
			flush_all_cam_entry(adapt);	/* clear CAM */
	}

	/* set MSR to AP_Mode		 */
	Set_MSR(adapt, _HW_STATE_AP_);

	/* Set BSSID REG */
	rtw_hal_set_hwreg(adapt, HW_VAR_BSSID, pnetwork->MacAddress);

	/* Set EDCA param reg */
#ifdef CONFIG_CONCURRENT_MODE
	acparm = 0x005ea42b;
#else
	acparm = 0x002F3217; /* VO */
#endif
	rtw_hal_set_hwreg(adapt, HW_VAR_AC_PARAM_VO, (u8 *)(&acparm));
	acparm = 0x005E4317; /* VI */
	rtw_hal_set_hwreg(adapt, HW_VAR_AC_PARAM_VI, (u8 *)(&acparm));
	/* acparm = 0x00105320; */ /* BE */
	acparm = 0x005ea42b;
	rtw_hal_set_hwreg(adapt, HW_VAR_AC_PARAM_BE, (u8 *)(&acparm));
	acparm = 0x0000A444; /* BK */
	rtw_hal_set_hwreg(adapt, HW_VAR_AC_PARAM_BK, (u8 *)(&acparm));

	/* Set Security */
	val8 = (psecuritypriv->dot11AuthAlgrthm == dot11AuthAlgrthm_8021X) ? 0xcc : 0xcf;
	rtw_hal_set_hwreg(adapt, HW_VAR_SEC_CFG, (u8 *)(&val8));

	/* Beacon Control related register */
	rtw_hal_set_hwreg(adapt, HW_VAR_BEACON_INTERVAL, (u8 *)(&bcn_interval));

chbw_decision:
	ch_setting_changed = rtw_ap_chbw_decision(adapt, req_ch, req_bw, req_offset
		     , &ch_to_set, &bw_to_set, &offset_to_set, &chbw_allow);

	/* let pnetwork_mlme == pnetwork_mlmeext */
	memcpy(pnetwork, pnetwork_mlmeext, pnetwork_mlmeext->Length);

	rtw_start_bss_hdl_after_chbw_decided(adapt);

	rtw_hal_rcr_set_chk_bssid(adapt, self_action);

	if (!IS_CH_WAITING(adapter_to_rfctl(adapt))) {

		doiqk = true;
		rtw_hal_set_hwreg(adapt , HW_VAR_DO_IQK , &doiqk);
	}

	if (ch_to_set != 0) {
		set_channel_bwmode(adapt, ch_to_set, offset_to_set, bw_to_set);
		rtw_mi_update_union_chan_inf(adapt, ch_to_set, offset_to_set, bw_to_set);
	}

	doiqk = false;
	rtw_hal_set_hwreg(adapt , HW_VAR_DO_IQK , &doiqk);

	if (ch_setting_changed
		&& (MLME_IS_GO(adapt) || MLME_IS_MESH(adapt)) /* pure AP is not needed*/
		&& check_fwstate(pmlmepriv, WIFI_ASOC_STATE)
	) {
		#if (LINUX_VERSION_CODE >= KERNEL_VERSION(3, 5, 0))
		rtw_cfg80211_ch_switch_notify(adapt
			, pmlmeext->cur_channel, pmlmeext->cur_bwmode, pmlmeext->cur_ch_offset
			, pmlmepriv->htpriv.ht_option);
		#endif
	}

	if (DUMP_ADAPTERS_STATUS) {
		RTW_INFO(FUNC_ADPT_FMT" done\n", FUNC_ADPT_ARG(adapt));
		dump_adapters_status(RTW_DBGDUMP , adapter_to_dvobj(adapt));
	}
	/* update beacon content only if bstart_bss is true */
	if (pmlmeext->bstart_bss) {
		if ((ATOMIC_READ(&pmlmepriv->olbc)) || (ATOMIC_READ(&pmlmepriv->olbc_ht))) {
			/* AP is not starting a 40 MHz BSS in presence of an 802.11g BSS. */

			pmlmepriv->ht_op_mode &= (~HT_INFO_OPERATION_MODE_OP_MODE_MASK);
			pmlmepriv->ht_op_mode |= OP_MODE_MAY_BE_LEGACY_STAS;
			update_beacon(adapt, _HT_ADD_INFO_IE_, NULL, false);
		}

		update_beacon(adapt, _TIM_IE_, NULL, false);
	}

	rtw_scan_wait_completed(adapt);

	/* send beacon */
	if (!rtw_mi_check_fwstate(adapt, _FW_UNDER_SURVEY)) {

		/*update_beacon(adapt, _TIM_IE_, NULL, true);*/

