sebanc/brunch/external-drivers/rtl8723du/core/rtw_ap.c
	}

	/*associated_clients_update(adapt, beacon_updated, sta_info_update_type);*/

}

static void update_bcn_rsn_ie(struct adapter *adapt)
{
	RTW_INFO("%s\n", __func__);

}

static void update_bcn_wpa_ie(struct adapter *adapt)
{
	RTW_INFO("%s\n", __func__);

}

static void update_bcn_wmm_ie(struct adapter *adapt)
{
	RTW_INFO("%s\n", __func__);

}

static void update_bcn_wps_ie(struct adapter *adapt)
{
	u8 *pwps_ie = NULL, *pwps_ie_src, *premainder_ie, *pbackup_remainder_ie = NULL;
	uint wps_ielen = 0, wps_offset, remainder_ielen;
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);
	struct mlme_ext_priv	*pmlmeext = &(adapt->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	struct wlan_bssid_ex *pnetwork = &(pmlmeinfo->network);
	unsigned char *ie = pnetwork->IEs;
	u32 ielen = pnetwork->IELength;


	RTW_INFO("%s\n", __func__);

	pwps_ie = rtw_get_wps_ie(ie + _FIXED_IE_LENGTH_, ielen - _FIXED_IE_LENGTH_, NULL, &wps_ielen);

	if (!pwps_ie || wps_ielen == 0)
		return;

	pwps_ie_src = pmlmepriv->wps_beacon_ie;
	if (!pwps_ie_src)
		return;

	wps_offset = (uint)(pwps_ie - ie);

	premainder_ie = pwps_ie + wps_ielen;

	remainder_ielen = ielen - wps_offset - wps_ielen;

	if (remainder_ielen > 0) {
		pbackup_remainder_ie = rtw_malloc(remainder_ielen);
		if (pbackup_remainder_ie)
			memcpy(pbackup_remainder_ie, premainder_ie, remainder_ielen);
	}

	wps_ielen = (uint)pwps_ie_src[1];/* to get ie data len */
	if ((wps_offset + wps_ielen + 2 + remainder_ielen) <= MAX_IE_SZ) {
		memcpy(pwps_ie, pwps_ie_src, wps_ielen + 2);
		pwps_ie += (wps_ielen + 2);

		if (pbackup_remainder_ie)
			memcpy(pwps_ie, pbackup_remainder_ie, remainder_ielen);

		/* update IELength */
		pnetwork->IELength = wps_offset + (wps_ielen + 2) + remainder_ielen;
	}

	if (pbackup_remainder_ie)
		rtw_mfree(pbackup_remainder_ie, remainder_ielen);
}

static void update_bcn_p2p_ie(struct adapter *adapt)
{
}

static void update_bcn_vendor_spec_ie(struct adapter *adapt, u8 *oui)
{
	RTW_INFO("%s\n", __func__);

	if (!memcmp(RTW_WPA_OUI, oui, 4))
		update_bcn_wpa_ie(adapt);
	else if (!memcmp(WMM_OUI, oui, 4))
		update_bcn_wmm_ie(adapt);
	else if (!memcmp(WPS_OUI, oui, 4))
		update_bcn_wps_ie(adapt);
	else if (!memcmp(P2P_OUI, oui, 4))
		update_bcn_p2p_ie(adapt);
	else
		RTW_INFO("unknown OUI type!\n");


}

void _update_beacon(struct adapter *adapt, u8 ie_id, u8 *oui, u8 tx, const char *tag)
{
	unsigned long irqL;
	struct mlme_priv *pmlmepriv;
	struct mlme_ext_priv *pmlmeext;

	if (!adapt)
		return;

	pmlmepriv = &(adapt->mlmepriv);
	pmlmeext = &(adapt->mlmeextpriv);

	if (!pmlmeext->bstart_bss)
		return;

	_enter_critical_bh(&pmlmepriv->bcn_update_lock, &irqL);

	switch (ie_id) {
	case _TIM_IE_:
		update_BCNTIM(adapt);
		break;

	case _ERPINFO_IE_:
		update_bcn_erpinfo_ie(adapt);
		break;

	case _HT_CAPABILITY_IE_:
		update_bcn_htcap_ie(adapt);
		break;

	case _RSN_IE_2_:
		update_bcn_rsn_ie(adapt);
		break;

	case _HT_ADD_INFO_IE_:
		update_bcn_htinfo_ie(adapt);
		break;

	case _EXT_CAP_IE_:
		update_bcn_ext_capab_ie(adapt);
		break;

	case _VENDOR_SPECIFIC_IE_:
		update_bcn_vendor_spec_ie(adapt, oui);
		break;

	case 0xFF:
	default:
		break;
	}

	pmlmepriv->update_bcn = true;

	_exit_critical_bh(&pmlmepriv->bcn_update_lock, &irqL);

	if (tx) {
		/* send_beacon must execute on TSR level */
		set_tx_beacon_cmd(adapt);
	}
}

void rtw_process_public_act_bsscoex(struct adapter *adapt, u8 *pframe, uint frame_len)
{
	struct sta_info *psta;
	struct sta_priv *pstapriv = &adapt->stapriv;
	u8 beacon_updated = false;
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);
	u8 *frame_body = pframe + sizeof(struct rtw_ieee80211_hdr_3addr);
	uint frame_body_len = frame_len - sizeof(struct rtw_ieee80211_hdr_3addr);
	u8 category, action;

	psta = rtw_get_stainfo(pstapriv, get_addr2_ptr(pframe));
	if (!psta)
		return;


	category = frame_body[0];
	action = frame_body[1];

	if (frame_body_len > 0) {
		if ((frame_body[2] == EID_BSSCoexistence) && (frame_body[3] > 0)) {
			u8 ie_data = frame_body[4];

			if (ie_data & RTW_WLAN_20_40_BSS_COEX_40MHZ_INTOL) {
				if (psta->ht_40mhz_intolerant == 0) {
					psta->ht_40mhz_intolerant = 1;
					pmlmepriv->num_sta_40mhz_intolerant++;
					beacon_updated = true;
				}
			} else if (ie_data & RTW_WLAN_20_40_BSS_COEX_20MHZ_WIDTH_REQ)	{
				if (!pmlmepriv->ht_20mhz_width_req) {
					pmlmepriv->ht_20mhz_width_req = true;
					beacon_updated = true;
				}
			} else
				beacon_updated = false;
		}
	}

	if (frame_body_len > 8) {
		/* if EID_BSSIntolerantChlReport ie exists */
		if ((frame_body[5] == EID_BSSIntolerantChlReport) && (frame_body[6] > 0)) {
			/*todo:*/
			if (!pmlmepriv->ht_intolerant_ch_reported) {
				pmlmepriv->ht_intolerant_ch_reported = true;
				beacon_updated = true;
			}
		}
	}

	if (beacon_updated) {

		update_beacon(adapt, _HT_ADD_INFO_IE_, NULL, true);

		associated_stainfo_update(adapt, psta, STA_INFO_UPDATE_BW);
	}



}

void rtw_process_ht_action_smps(struct adapter *adapt, u8 *ta, u8 ctrl_field)
{
	u8 e_field, m_field;
	struct sta_info *psta;
	struct sta_priv *pstapriv = &adapt->stapriv;

	psta = rtw_get_stainfo(pstapriv, ta);
	if (!psta)
		return;

	e_field = (ctrl_field & BIT(0)) ? 1 : 0;
	m_field = (ctrl_field & BIT(1)) ? 1 : 0;

	if (e_field) {

		/* enable */
		/* 0:static SMPS, 1:dynamic SMPS, 3:SMPS disabled, 2:reserved*/

		if (m_field) /*mode*/
			psta->htpriv.smps_cap = 1;
		else
			psta->htpriv.smps_cap = 0;
	} else {
		/*disable*/
		psta->htpriv.smps_cap = 3;
	}

	rtw_dm_ra_mask_wk_cmd(adapt, (u8 *)psta);

}

/*
op_mode
Set to 0 (HT pure) under the followign conditions
	- all STAs in the BSS are 20/40 MHz HT in 20/40 MHz BSS or
	- all STAs in the BSS are 20 MHz HT in 20 MHz BSS
Set to 1 (HT non-member protection) if there may be non-HT STAs
	in both the primary and the secondary channel
Set to 2 if only HT STAs are associated in BSS,
	however and at least one 20 MHz HT STA is associated
Set to 3 (HT mixed mode) when one or more non-HT STAs are associated
	(currently non-GF HT station is considered as non-HT STA also)
*/
int rtw_ht_operation_update(struct adapter *adapt)
{
	u16 cur_op_mode, new_op_mode;
	int op_mode_changes = 0;
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);
	struct ht_priv	*phtpriv_ap = &pmlmepriv->htpriv;

	if (!pmlmepriv->htpriv.ht_option)
		return 0;

	/*if (!iface->conf->ieee80211n || iface->conf->ht_op_mode_fixed)
		return 0;*/

	RTW_INFO("%s current operation mode=0x%X\n",
		 __func__, pmlmepriv->ht_op_mode);

