sebanc/brunch/external-drivers/rtl8723du/core/rtw_ap.c
	issue_deauth(adapt, bc_addr, WLAN_REASON_DEAUTH_LEAVING);

	associated_clients_update(adapt, true, STA_INFO_UPDATE_ALL);

	return ret;
}

/* called > TSR LEVEL for USB or SDIO Interface*/
void sta_info_update(struct adapter *adapt, struct sta_info *psta)
{
	int flags = psta->flags;
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);


	/* update wmm cap. */
	if (WLAN_STA_WME & flags)
		psta->qos_option = 1;
	else
		psta->qos_option = 0;

	if (pmlmepriv->qospriv.qos_option == 0)
		psta->qos_option = 0;


	/* update 802.11n ht cap. */
	if (WLAN_STA_HT & flags) {
		psta->htpriv.ht_option = true;
		psta->qos_option = 1;

		psta->htpriv.smps_cap = le16_to_cpu(psta->htpriv.ht_cap.cap_info) & IEEE80211_HT_CAP_SM_PS >> 2;
	} else
		psta->htpriv.ht_option = false;

	if (!pmlmepriv->htpriv.ht_option)
		psta->htpriv.ht_option = false;

	update_sta_info_apmode(adapt, psta);
}

/* called >= TSR LEVEL for USB or SDIO Interface*/
void ap_sta_info_defer_update(struct adapter *adapt, struct sta_info *psta)
{
	if (psta->state & _FW_LINKED)
		rtw_hal_update_ra_mask(psta); /* DM_RATR_STA_INIT */
}
/* restore hw setting from sw data structures */
void rtw_ap_restore_network(struct adapter *adapt)
{
	struct mlme_ext_priv	*pmlmeext = &adapt->mlmeextpriv;
	struct sta_priv *pstapriv = &adapt->stapriv;
	struct sta_info *psta;
	struct security_priv *psecuritypriv = &(adapt->securitypriv);
	unsigned long irqL;
	struct list_head	*phead, *plist;
	u8 chk_alive_num = 0;
	char chk_alive_list[NUM_STA];
	int i;

	rtw_setopmode_cmd(adapt, Ndis802_11APMode, RTW_CMDF_DIRECTLY);

	set_channel_bwmode(adapt, pmlmeext->cur_channel, pmlmeext->cur_ch_offset, pmlmeext->cur_bwmode);

	rtw_startbss_cmd(adapt, RTW_CMDF_DIRECTLY);

	if ((adapt->securitypriv.dot11PrivacyAlgrthm == _TKIP_) ||
	    (adapt->securitypriv.dot11PrivacyAlgrthm == _AES_)) {
		/* restore group key, WEP keys is restored in ips_leave() */
		rtw_set_key(adapt, psecuritypriv, psecuritypriv->dot118021XGrpKeyid, 0, false);
	}

	_enter_critical_bh(&pstapriv->asoc_list_lock, &irqL);

	phead = &pstapriv->asoc_list;
	plist = get_next(phead);

	while ((!rtw_end_of_queue_search(phead, plist))) {
		int stainfo_offset;

		psta = container_of(plist, struct sta_info, asoc_list);
		plist = get_next(plist);

		stainfo_offset = rtw_stainfo_offset(pstapriv, psta);
		if (stainfo_offset_valid(stainfo_offset))
			chk_alive_list[chk_alive_num++] = stainfo_offset;
	}

	_exit_critical_bh(&pstapriv->asoc_list_lock, &irqL);

	for (i = 0; i < chk_alive_num; i++) {
		psta = rtw_get_stainfo_by_offset(pstapriv, chk_alive_list[i]);

		if (!psta)
			RTW_INFO(FUNC_ADPT_FMT" sta_info is null\n", FUNC_ADPT_ARG(adapt));
		else if (psta->state & _FW_LINKED) {
			rtw_sta_media_status_rpt(adapt, psta, 1);
			Update_RA_Entry(adapt, psta);
			/* pairwise key */
			/* per sta pairwise key and settings */
			if ((adapt->securitypriv.dot11PrivacyAlgrthm == _TKIP_) ||
			    (adapt->securitypriv.dot11PrivacyAlgrthm == _AES_))
				rtw_setstakey_cmd(adapt, psta, UNICAST_KEY, false);
		}
	}

}

void start_ap_mode(struct adapter *adapt)
{
	int i;
	struct sta_info *psta = NULL;
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);
	struct sta_priv *pstapriv = &adapt->stapriv;
	struct mlme_ext_priv *pmlmeext = &adapt->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);

	pmlmepriv->update_bcn = false;

	/*init_mlme_ap_info(adapt);*/

	pmlmeext->bstart_bss = false;

	pmlmepriv->num_sta_non_erp = 0;

	pmlmepriv->num_sta_no_short_slot_time = 0;

	pmlmepriv->num_sta_no_short_preamble = 0;

	pmlmepriv->num_sta_ht_no_gf = 0;
	pmlmepriv->num_sta_no_ht = 0;
	pmlmeinfo->HT_info_enable = 0;
	pmlmeinfo->HT_caps_enable = 0;
	pmlmeinfo->HT_enable = 0;

	pmlmepriv->num_sta_ht_20mhz = 0;
	pmlmepriv->num_sta_40mhz_intolerant = 0;
	ATOMIC_SET(&pmlmepriv->olbc, false);
	ATOMIC_SET(&pmlmepriv->olbc_ht, false);

	pmlmepriv->ht_20mhz_width_req = false;
	pmlmepriv->ht_intolerant_ch_reported = false;
	pmlmepriv->ht_op_mode = 0;
	pmlmepriv->sw_to_20mhz = 0;

	memset(pmlmepriv->ext_capab_ie_data, 0, sizeof(pmlmepriv->ext_capab_ie_data));
	pmlmepriv->ext_capab_ie_len = 0;

#ifdef CONFIG_CONCURRENT_MODE
	adapt->securitypriv.dot118021x_bmc_cam_id = INVALID_SEC_MAC_CAM_ID;
#endif

	for (i = 0 ;  i < pstapriv->max_aid; i++)
		pstapriv->sta_aid[i] = NULL;

#if CONFIG_RTW_MACADDR_ACL
	rtw_macaddr_acl_init(adapt);
#endif

	psta = rtw_get_bcmc_stainfo(adapt);
	/*_enter_critical_bh(&(pstapriv->sta_hash_lock), &irqL);*/
	if (psta)
		rtw_free_stainfo(adapt, psta);
	/*_exit_critical_bh(&(pstapriv->sta_hash_lock), &irqL);*/

	rtw_init_bcmc_stainfo(adapt);

	if (rtw_mi_get_ap_num(adapt))
		RTW_SET_SCAN_BAND_SKIP(adapt, BAND_5G);

}

static void rtw_ap_bcmc_sta_flush(struct adapter *adapt)
{
#ifdef CONFIG_CONCURRENT_MODE
	int cam_id = -1;
	u8 *addr = adapter_mac_addr(adapt);

	cam_id = rtw_iface_bcmc_id_get(adapt);
	if (cam_id != INVALID_SEC_MAC_CAM_ID) {
		RTW_PRINT("clear group key for "ADPT_FMT" addr:"MAC_FMT", camid:%d\n",
			ADPT_ARG(adapt), MAC_ARG(addr), cam_id);
		clear_cam_entry(adapt, cam_id);
		rtw_camid_free(adapt, cam_id);
		rtw_iface_bcmc_id_set(adapt, INVALID_SEC_MAC_CAM_ID);	/*init default value*/
	}
#else
	invalidate_cam_all(adapt);
#endif
}

void stop_ap_mode(struct adapter *adapt)
{
	u8 self_action = MLME_ACTION_UNKNOWN;
	struct sta_info *psta = NULL;
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);
	struct mlme_ext_priv *pmlmeext = &adapt->mlmeextpriv;

	RTW_INFO("%s -"ADPT_FMT"\n", __func__, ADPT_ARG(adapt));

	if (MLME_IS_AP(adapt))
		self_action = MLME_AP_STOPPED;
	else if (MLME_IS_MESH(adapt))
		self_action = MLME_MESH_STOPPED;
	else
		rtw_warn_on(1);

	pmlmepriv->update_bcn = false;
	adapt->netif_up = false;
	memset((unsigned char *)&adapt->securitypriv, 0, sizeof(struct security_priv));
	adapt->securitypriv.ndisauthtype = Ndis802_11AuthModeOpen;
	adapt->securitypriv.ndisencryptstatus = Ndis802_11WEPDisabled;

	/* free scan queue */
	rtw_free_network_queue(adapt, true);

#if CONFIG_RTW_MACADDR_ACL
	rtw_macaddr_acl_deinit(adapt);
#endif

	rtw_sta_flush(adapt, true);
	rtw_ap_bcmc_sta_flush(adapt);

	/* free_assoc_sta_resources	 */
	rtw_free_all_stainfo(adapt);

	psta = rtw_get_bcmc_stainfo(adapt);
	if (psta) {
		rtw_sta_mstatus_disc_rpt(adapt, psta->cmn.mac_id);
		/* _enter_critical_bh(&(pstapriv->sta_hash_lock), &irqL);		 */
		rtw_free_stainfo(adapt, psta);
		/*_exit_critical_bh(&(pstapriv->sta_hash_lock), &irqL);*/
	}

	rtw_free_mlme_priv_ie_data(pmlmepriv);

	pmlmeext->bstart_bss = false;

